/*
SQLyog Community v13.1.6 (64 bit)
MySQL - 5.7.42 : Database - xanadu_ac
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`xanadu_ac` /*!40100 DEFAULT CHARACTER SET latin1 */;

USE `xanadu_ac`;

/*Table structure for table `ac_invoice` */

DROP TABLE IF EXISTS `ac_invoice`;

CREATE TABLE `ac_invoice` (
  `id` int(20) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `start_number` varchar(255) NOT NULL COMMENT '开始号码',
  `end_number` varchar(255) NOT NULL COMMENT '结束号码',
  `registration` varchar(5) NOT NULL DEFAULT '未登记' COMMENT '登记状态',
  `batch` int(255) NOT NULL COMMENT '批次',
  `total` int(30) NOT NULL COMMENT '本数',
  `time` datetime NOT NULL COMMENT '发票生成日期',
  `substation_id` varchar(255) DEFAULT '暂无信息' COMMENT '分站id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='发票记录';

/*Data for the table `ac_invoice` */

insert  into `ac_invoice`(`id`,`start_number`,`end_number`,`registration`,`batch`,`total`,`time`,`substation_id`) values 
(1,'RE20230606002','RE20230606053','已登记',2,51,'2023-06-06 10:29:47','1'),
(2,'UE20230609019','UE20230609060','已登记',1,41,'2023-06-10 03:45:21','2'),
(3,'RE20230606002','RE20230606053','已登记',2,41,'2023-06-10 03:45:21','暂无信息'),
(4,'CY20230606001','CY20230606080','已登记',2,79,'2023-06-17 03:45:21','3'),
(5,'RE20230606002','RE20230606053','已登记',2,41,'2023-06-10 03:45:21','暂无信息'),
(6,'RE20230606002','RE20230606053','已登记',2,41,'2023-06-10 03:45:21','暂无信息'),
(7,'RE20230606002','RE20230606053','已登记',2,41,'2023-06-10 03:45:21','暂无信息'),
(8,'UE20230609019','UE20230609060','未登记',3,41,'2023-06-10 03:45:21','暂无信息'),
(50,'WH20230626001','WH20230626005','已登记',3,5,'2023-06-27 16:07:51','暂无信息'),
(51,'UY20230606001','UY20230606080','已登记',4,80,'2023-06-28 00:30:58','暂无信息'),
(52,'UJ20230705010','UJ20230705020','未登记',4,10,'2023-07-05 18:33:06','暂无信息');

/*Table structure for table `ac_invoices` */

DROP TABLE IF EXISTS `ac_invoices`;

CREATE TABLE `ac_invoices` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `totalid` bigint(20) NOT NULL COMMENT '发票批次序号',
  `number` varchar(30) NOT NULL COMMENT '发票号码',
  `state` varchar(255) DEFAULT '未领用' COMMENT '发票领用状态',
  `batch` int(255) NOT NULL COMMENT '批次',
  `substation_id` varchar(255) NOT NULL DEFAULT '暂无信息' COMMENT '分站id',
  `employee` varchar(255) NOT NULL DEFAULT '暂无信息' COMMENT '领用人',
  `dstate` varchar(255) NOT NULL DEFAULT '生效中' COMMENT '失效状态',
  `details` varchar(255) NOT NULL DEFAULT '无' COMMENT '失效原因',
  `order_id` varchar(255) NOT NULL DEFAULT '无' COMMENT '订单号',
  `printtime` datetime DEFAULT NULL COMMENT '打印时间',
  `productName` varchar(255) DEFAULT '无' COMMENT '商品名称',
  `productNum` varchar(255) DEFAULT '无' COMMENT '商品数量',
  PRIMARY KEY (`id`,`employee`)
) ENGINE=InnoDB AUTO_INCREMENT=136 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='分站发票管理';

/*Data for the table `ac_invoices` */

insert  into `ac_invoices`(`id`,`totalid`,`number`,`state`,`batch`,`substation_id`,`employee`,`dstate`,`details`,`order_id`,`printtime`,`productName`,`productNum`) values 
(1,1,'RE20230606002','已领用',1,'1','某个快递员','生效中','无','95',NULL,'420','60'),
(2,1,'RE20230606003','未领用',1,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(3,1,'RE20230606004','已领用',2,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(4,1,'RE20230606005','未领用',1,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(5,2,'UE20230609019','未领用',2,'2','暂无信息','生效中','发票丢失','无',NULL,'无','无'),
(41,50,'WH2023062001','未领用',3,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(42,50,'WH2023062002','未领用',3,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(43,50,'WH2023062003','未领用',3,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(44,50,'WH2023062004','未领用',3,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(45,50,'WH2023062005','未领用',3,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(46,51,'UY2023060001','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(47,51,'UY2023060002','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(48,51,'UY2023060003','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(49,51,'UY2023060004','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(50,51,'UY2023060005','未领用',3,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(51,51,'UY2023060006','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(52,51,'UY2023060007','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(53,51,'UY2023060008','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(54,51,'UY2023060009','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(55,51,'UY2023060010','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(56,51,'UY2023060011','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(57,51,'UY2023060012','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(58,51,'UY2023060013','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(59,51,'UY2023060014','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(60,51,'UY2023060015','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(61,51,'UY2023060016','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(62,51,'UY2023060017','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(63,51,'UY2023060018','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(64,51,'UY2023060019','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(65,51,'UY2023060020','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(66,51,'UY2023060021','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(67,51,'UY2023060022','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(68,51,'UY2023060023','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(69,51,'UY2023060024','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(70,51,'UY2023060025','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(71,51,'UY2023060026','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(72,51,'UY2023060027','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(73,51,'UY2023060028','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(74,51,'UY2023060029','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(75,51,'UY2023060030','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(76,51,'UY2023060031','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(77,51,'UY2023060032','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(78,51,'UY2023060033','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(79,51,'UY2023060034','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(80,51,'UY2023060035','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(81,51,'UY2023060036','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(82,51,'UY2023060037','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(83,51,'UY2023060038','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(84,51,'UY2023060039','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(85,51,'UY2023060040','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(86,51,'UY2023060041','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(87,51,'UY2023060042','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(88,51,'UY2023060043','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(89,51,'UY2023060044','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(90,51,'UY2023060045','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(91,51,'UY2023060046','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(92,51,'UY2023060047','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(93,51,'UY2023060048','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(94,51,'UY2023060049','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(95,51,'UY2023060050','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(96,51,'UY2023060051','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(97,51,'UY2023060052','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(98,51,'UY2023060053','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(99,51,'UY2023060054','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(100,51,'UY2023060055','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(101,51,'UY2023060056','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(102,51,'UY2023060057','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(103,51,'UY2023060058','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(104,51,'UY2023060059','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(105,51,'UY2023060060','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(106,51,'UY2023060061','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(107,51,'UY2023060062','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(108,51,'UY2023060063','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(109,51,'UY2023060064','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(110,51,'UY2023060065','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(111,51,'UY2023060066','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(112,51,'UY2023060067','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(113,51,'UY2023060068','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(114,51,'UY2023060069','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(115,51,'UY2023060070','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(116,51,'UY2023060071','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(117,51,'UY2023060072','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(118,51,'UY2023060073','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(119,51,'UY2023060074','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(120,51,'UY2023060075','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(121,51,'UY2023060076','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(122,51,'UY2023060077','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(123,51,'UY2023060078','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(124,51,'UY2023060079','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(125,51,'UY2023060080','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(126,52,'UJ2023070002','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(127,52,'UJ2023070003','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(128,52,'UJ2023070004','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(129,52,'UJ2023070005','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(130,52,'UJ2023070006','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(131,52,'UJ2023070007','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(132,52,'UJ2023070008','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(133,52,'UJ2023070009','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(134,52,'UJ2023070010','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无'),
(135,52,'UJ2023070011','未领用',4,'暂无信息','暂无信息','生效中','无','无',NULL,'无','无');

/*Table structure for table `ac_supply` */

DROP TABLE IF EXISTS `ac_supply`;

CREATE TABLE `ac_supply` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `supplier_id` bigint(20) DEFAULT NULL COMMENT '供应商ID',
  `product_name` varchar(255) DEFAULT NULL COMMENT '商品名称',
  `price` double(10,2) DEFAULT NULL COMMENT '单价',
  `supply_num` int(11) DEFAULT NULL COMMENT '供货数量',
  `return_num` int(11) DEFAULT NULL COMMENT '退回数量',
  `total_num` int(11) DEFAULT NULL COMMENT '结算数量',
  `total_amount` double(10,2) DEFAULT NULL COMMENT '结算金额',
  `time` datetime DEFAULT NULL COMMENT '日期',
  `deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否结算',
  `settleType` varchar(5) NOT NULL DEFAULT '退款' COMMENT '退款还是支出',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

/*Data for the table `ac_supply` */

insert  into `ac_supply`(`id`,`supplier_id`,`product_name`,`price`,`supply_num`,`return_num`,`total_num`,`total_amount`,`time`,`deleted`,`settleType`) values 
(17,1,'笔记本电脑',9000.00,100,150,-50,450000.00,'2023-06-30 10:02:23',0,'退款'),
(18,1,'笔记本电脑',9000.00,100,0,100,900000.00,'2023-06-30 11:16:56',0,'支出'),
(19,1,'华为手机',2499.00,0,150,-150,374850.00,'2023-06-30 11:18:02',0,'退款'),
(20,1,'索尼相机',16999.00,0,10,-10,169990.00,'2023-06-30 11:48:23',0,'退款');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
